[
    {
        "sectionTitle": "As a Designer",
        "img": "page/When-Im-Designing.png",
        "alt": "When I'm Designing Portrait",
        "content": [
            "Legend has it I didn’t cry when I was born: I came into the world picking color wheels and overanalyzing keyframes. Visual design is the blood that pumps through my body each and every day when I wake up ready to create.",
            "Four years of high school projects led me to the Rochester Institute of Technology’s Media Arts and Technology major. Here I honed my skills and became a creative force that specializes in publication design, video production, and social media content. ",
            "After RIT, I spent four years as a Communications & Marketing Coordinator for Saint Joseph High School in Metuchen, NJ. Here, I led the design aspects of all communications & marketing projects from inception to completion. This included the bi-annual TODAY Magazine, all social media channels, and multimedia campaigns for admissions, fundraising, and all other school needs.",
            "Now, I am embarking on the quest to find my next creative challenge. I cannot wait to nestle into my next home and bring all their concepts to life through multimedia design!"
        ]
    },
    {
        "sectionTitle": "When I’m Not Designing",
        "img": "page/When-Im-Not-Designing.png",
        "alt": "When I'm Not Designing Portrait",
        "content": [
            "On the off chance I’m not fulfilling my indentured servitude to getting the most out of my monthly payments to the Adobe overlords, I am likely hanging out with my friends on Discord, reading, finding new craft beer to try, or going to see what’s the latest at my local AMC Theatre.",
            "I’m an avid consumer of a wide range of media, especially comics, manga, novels, animation, and video games. Some of my favorite things include visual novel games, the band Gorillaz, and exploring fictional worlds like that of Dune, The Cosmere, The Lord of the Rings, and Star Wars.",
            "Fun facts about me: I’m a very proud lefty, I graduated in the top 1% of my class at RIT, I have a collection of over 300 Funko Pops!, and I love attending nerdy conventions like New York Comic Con and Anime NYC!"
        ]
    }
]
