[
    {
        "sectionTitle": "As a Designer",
        "img": "page/When-Im-Designing.png",
        "alt": "When I'm Designing Portrait",
        "content": [
            "Legend has it I didn’t cry when I was born: I came into the world picking color wheels and overanalyzing keyframes. I’ve been interested in expressing creativity for as long as I can remember, which countless drawings and home movies can attest to.",
            "I started getting serious about design in middle school when I began to learn to edit video clips on the computer and use Microsoft Paint to make wallpapers for my friends. After four years of high school and upgrades to both my software and equipment used, I was my school’s lead student videographer and the Editor-in-Chief of the yearbook. ",
            "This led me to the Rochester Institute of Technology’s Media Arts and Technology major, and eventually to my current position as the Communications and Marketing Coordinator for Saint Joseph High School. ",
            "As a multimedia artist, I specialize in magazine production, videography, and social media management. I truly enjoy creating unique and visually appealing experiences for people, whether that be in print or on the screen!"
        ]
    },
    {
        "sectionTitle": "When I’m Not Designing",
        "img": "page/When-Im-Not-Designing.png",
        "alt": "When I'm Not Designing Portrait",
        "content": [
            "On the off chance I’m not fulfilling my indentured servitude to getting the most out of my monthly payments to the Adobe overlords, I am likely hanging out with my friends on Discord, reading comics/manga, finding new craft beer to try, or going to see what’s the latest at my local AMC Theater.",
            "I’m an avid consumer of a wide range of media, although I can’t help but analyze everything I take in and use it as inspiration for my own work. Some of my favorite things include the Sly Cooper video games, the band Gorillaz, Jesus Christ Superstar, Invincible, and exploring fictional worlds like that of Dune, The Lord of the Rings, and Star Wars.",
            "Fun facts about me: I’m a very proud lefty, I graduated in the top 1% of my class at RIT, I have a collection of over 300 Funko Pops!, and I love attending nerdy conventions like New York Comic Con and Anime NYC!"
        ]
    }
]
