[
    {
        "header": "Magazines",
        "content": [
            {
                "title": "Annual Report",
                "date": "2022",
                "description": "The 2022 Annual Report is a larger-scale magazine that incorporates both the traditional article format, as well as donor information, statistics, and infographics. At a whopping 40 pages, this is my largest magazine project to date! I am also very proud of this project because it marked a shift in my mindset for magazine production, trying to replicate the feel of a collegiate publication more so than my previous works. I not only designed this whole magazine, but also contributed my writing skills to several articles.",
                "slug": "st-joes-annual-report-2022",
                "imgSmall": "magazine/st-joes-annual-report-2022.png",
                "imgLarge": "magazine/st-joes-annual-report-2022.png",
                "externalLink": "",
                "alt": "St. Joes 2022 annual report cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Fall 2023",
                "description": "The Fall 2023 edition of TODAY Magazine was a more in depth experience for me as a designer, as I took a more hands on approach with some of the articles and the content for the layouts. For example, I got to coordinate and photograph people that were featured in articles, and stage my vision in such a way that it became a reality on the printed pages.",
                "slug": "TODAY-Fall-2023",
                "imgSmall": "magazine/TODAY-Fall-2023.png",
                "imgLarge": "magazine/TODAY-Fall-2023.png",
                "externalLink": "",
                "alt": "St. Joes Fall 2023 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production, Magazine Photography",
                "software": "Adobe InDesign, Adobe Photoshop"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Summer 2023",
                "description": "The Summer 2023 edition of TODAY Magazine contains content from the second half of the academic year. Since the previous edition of the magazine, I spent a lot of time reading other academic magazines to gain inspiration for the creation of new styles of layouts for this run. I tried new editing techniques to create a visually appealing magazine that I could be proud of.",
                "slug": "TODAY-Summer-2023",
                "imgSmall": "magazine/TODAY-Summer-2023.png",
                "imgLarge": "magazine/TODAY-Summer-2023.png",
                "externalLink": "",
                "alt": "St. Joes Summer 2023 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign, Adobe Photoshop"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Fall 2022",
                "description": "The Fall 2022 Edition of the TODAY Magazine was my second run through of the publication, and I had picked up many tricks of the trade since my first edition in the Summer of 2022. As our “Back to School Edition”, it features several articles that update students, alumni, and friends about what Saint Joseph High School had planned for the new year.",
                "slug": "TODAY-fall-2022",
                "imgSmall": "magazine/TODAY-fall-2022.png",
                "imgLarge": "magazine/TODAY-fall-2022.png",
                "externalLink": "",
                "alt": "St. Joes Fall 2022 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Summer 2022",
                "description": "The Summer 2022 Edition of the TODAY Magazine will always hold a special place in my designer’s heart, as it was the first full length magazine I got to design for! In college I had primarily thought of myself as a video editor, but when I joined Saint Joseph High School’s Communications and Marketing team, I was given the opportunity to design all their magazine publications and I fell in love with print media. This first edition presented me with many challenges to overcome, especially having only worked briefly with magazines when I took an elective at RIT dedicated to them. Looking back there are many things I would do differently, but I learned more from this project than potentially anything else I have worked on.",
                "slug": "TODAY-spring-2022",
                "imgSmall": "magazine/TODAY-spring-2022.png",
                "imgLarge": "magazine/TODAY-spring-2022.png",
                "externalLink": "",
                "alt": "St. Joes Summer 2022 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Admissions Viewbook",
                "date": "2023",
                "description": "The 2023 Admissions Viewbook was a project where I was tasked with perfecting the previous year’s publication. I had to go through each spread, determining if it should be updated or completely revamped. Additionally, new admissions processes and programs had to be implemented, resulting in new original spreads. It is used as a sales piece to gather interest in prospective families and present the “Saint Joe’s Experience” to them.",
                "slug": "Viewbook-2023",
                "imgSmall": "magazine/Viewbook-2023.png",
                "imgLarge": "magazine/Viewbook-2023.png",
                "externalLink": "",
                "alt": "St. Joes 2023 Admissions Viewbook cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Admissions Viewbook",
                "date": "2022",
                "description": "The 2022 Admissions Viewbook, being my second magazine produced during my career, proposed new challenges and concepts to consider. The Viewbook serves the purpose of being the main printed source of information for prospective families. It walks families through the ins and outs of what makes Saint Joseph High School a unique experience and the offerings that are in store. Compared to the TODAY Magazine and Annual Reports, it is more of a sales piece than a traditional article based magazine. I had to take this all into consideration when deciding on which spreads to update from previous years and which ones to recreate entirely. ",
                "slug": "Viewbook-2022",
                "imgSmall": "magazine/Viewbook-2022.png",
                "imgLarge": "magazine/Viewbook-2022.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Admissions Viewbook cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Gala Ad Journal",
                "date": "Fall 2023",
                "description": "The Green Tie Gala 2023 Ad Journal is a print publication that features the ads and messages of Saint Joseph High School’s donors at our annual fundraising gala. I was responsible for coordinating with donors to see what they wanted in their printed ad. For most ads, I used provided logos to create congratulatory messages from the donor to the honorees of the gala. There were also several pages of original content. I managed this project and saw it through from inception to completion. ",
                "slug": "green-tie-gala-ad-journal-2023",
                "imgSmall": "magazine/Green-Tie-Gala-Ad-Journal-2023.png",
                "imgLarge": "magazine/Green-Tie-Gala-Ad-Journal-2023.png",
                "externalLink": "",
                "alt": "St. Joes 2023 Gala Ad Journal Cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production",
                "software": "Canva, Adobe InDesign"
            },
            {
                "title": "Gala Ad Journal",
                "date": "Fall 2022",
                "description": "The Green Tie Gala 2022 Ad Journal is a print publication that features the ads and messages of Saint Joseph High School’s donors at our annual fundraising gala. This project took a lot more “project management”, as I was responsible for connecting with donors who purchased an ad, communicating with them what they were looking for, designing the ad, getting approval, and figuring out a pagination with my supervisor.",
                "slug": "green-tie-gala-ad-journal-2022",
                "imgSmall": "magazine/green-tie-gala-ad-journal-2022.png",
                "imgLarge": "magazine/green-tie-gala-ad-journal-2022.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Gala Ad Journal Cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production",
                "software": "Canva, Adobe InDesign"
                
            }
        ]
    },
    {
        "header": "Display Graphics",
        "content": [
            {
                "title": "Gala Jumbotron",
                "date": "2022",
                "description": "This graphic was put on the jumbotron screen across from the Heldrich Hotel in New Brunswick, NJ during Saint Joseph High School’s Green Tie Gala fundraiser. It was used to congratulate Kevin M. Ryan, CEO of Covenant House International, who was the 2022 honoree at the gala. ",
                "slug": "st-joes-sign-gala",
                "imgSmall": "signs/gala-sign-small.png",
                "imgLarge": "signs/gala-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 gala sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Lent Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. I often create seasonal and holiday-based signs for the school, and this one was used to celebrate the beginning of Lent. I created the ash cross in Adobe Illustrator. ",
                "slug": "st-joes-sign-lent",
                "imgSmall": "signs/lent-sign-small.png",
                "imgLarge": "signs/lent-sign-largeV2.png",
                "externalLink": "",
                "alt": "St. Joes 2022 lent sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Adobe Illustrator, Adobe Photoshop"
                
            },
            {
                "title": "NBA Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to congratulate Karl Anthony Towns, a graduate from Saint Joe’s who has a career in the NBA and notably earned the title of All Star.  ",
                "slug": "st-joes-sign-NBA",
                "imgSmall": "signs/kat-sign-small.png",
                "imgLarge": "signs/kat-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 NBA sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Photo Manipulation",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Advent Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to commemorate the life of Brother Ronald Cairns, S.C., a longtime Partner in Mission who had recently passed away. The annual Advent Community Mass was held in recognition of his life, and the graphic was used to promote the mass.",
                "slug": "st-joes-sign-advent",
                "imgSmall": "signs/advent-sign-small.png",
                "imgLarge": "signs/advent-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Advent sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Wrestling Display Sign",
                "date": "2023",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to celebrate the accomplishments of our wrestling team for winning a county championship. ",
                "slug": "st-joes-sign-wrestling",
                "imgSmall": "signs/wrestling-sign-small.png",
                "imgLarge": "signs/wrestling-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2023 Wrestling sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Football Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. As a high school, we often celebrate our students’ accomplishments with recognition on the display sign. This was one entry in a series of promoting our senior athletes who signed on to play at the collegiate level.  ",
                "slug": "st-joes-sign-football",
                "imgSmall": "signs/football-sign-small.png",
                "imgLarge": "signs/football-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Football sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Photo Manipulation",
                "software": "Adobe Photoshop"
                
            }
        ]
    }
]
