[
    {
        "header": "Magazines & Books",
        "content": [
            {
                "title": "Nodecrazed Book",
                "date": "2024",
                "description": "My fantasy prose zine, Except If You Are Nodecrazed, is by far my proudest work. Written under my pen name, I drafted a short story about a lowly psychic Nodecrazed who explores the world inside the mind of a godlike being called The Node. For this process, I wrote and revised the story in Google Docs, drew the cover artwork in Photoshop, created imprint logos in Illustrator, and assembled everything in InDesign. This project took some time but I could not be more excited to have it as a reality. I am actively working on more stories in this universe.",
                "slug": "Book-Nodecrazed",
                "imgSmall": "illustration/nodecrazed-small.jpg",
                "imgLarge": "illustration/nodecrazed-large.jpg",
                "externalLink": "https://issuu.com/magnaflashstudios/docs/except_if_you_are_nodecrazed",
                "alt": "Fantasy Book Nodecrazed",
                "mediaType": "magazine",
                "skills": "Creative Writing, Graphic Design, Layout Design, Typography Design, Print Production, Logo Design, Illustration",
                "software": "Adobe InDesign, Adobe Photoshop, Adobe Illustrator, Google Docs"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Summer 2024",
                "description": "Magazine season at Saint Joseph High School…my favorite bi-annual time of year! After several months since our last publication, I spent a lot of time looking through the publications of other institutions to prepare and was itching to put new design techniques into practice. After much hard work, I am extremely proud of this issue and believe it marks how I have progressed as a magazine designer.",
                "slug": "TODAY-Summer-2024",
                "imgSmall": "magazine/magazine-today-summer-2024-small.jpg",
                "imgLarge": "magazine/magazine-today-summer-2024-small.jpg",
                "externalLink": "https://issuu.com/saintjoesmet/docs/today_magazine_june_2024",
                "alt": "St. Joes 2022 Summer 2024 TODAY cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Typography Design, Print Production, DSLR Operation (Canon Rebel SL3), Magazine Photography, Photo Processing",
                "software": "Adobe InDesign, Adobe Lightroom"
                
            },
            {
                "title": "Annual Report",
                "date": "2022",
                "description": "The 2022 Annual Report is a larger-scale magazine that incorporates both the traditional article format, as well as donor information, statistics, and infographics. At a whopping 40 pages, this is my largest magazine project to date! I am also very proud of this project because it marked a shift in my mindset for magazine production, trying to replicate the feel of a collegiate publication more so than my previous works. I not only designed this whole magazine, but also contributed my writing skills to several articles.",
                "slug": "st-joes-annual-report-2022",
                "imgSmall": "magazine/st-joes-annual-report-2022.png",
                "imgLarge": "magazine/st-joes-annual-report-2022.png",
                "externalLink": "https://issuu.com/saintjoesmet/docs/annual_report_2022_pages",
                "alt": "St. Joes 2022 annual report cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Fall 2023",
                "description": "The Fall 2023 edition of TODAY Magazine was a more in depth experience for me as a designer, as I took a more hands on approach with some of the articles and the content for the layouts. For example, I got to coordinate and photograph people that were featured in articles, and stage my vision in such a way that it became a reality on the printed pages.",
                "slug": "TODAY-Fall-2023",
                "imgSmall": "magazine/TODAY-Fall-2023.png",
                "imgLarge": "magazine/TODAY-Fall-2023.png",
                "externalLink": "https://issuu.com/saintjoesmet/docs/todaymagazinefall2023",
                "alt": "St. Joes Fall 2023 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production, Magazine Photography",
                "software": "Adobe InDesign, Adobe Photoshop"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Summer 2023",
                "description": "The Summer 2023 edition of TODAY Magazine contains content from the second half of the academic year. Since the previous edition of the magazine, I spent a lot of time reading other academic magazines to gain inspiration for the creation of new styles of layouts for this run. I tried new editing techniques to create a visually appealing magazine that I could be proud of.",
                "slug": "TODAY-Summer-2023",
                "imgSmall": "magazine/TODAY-Summer-2023.png",
                "imgLarge": "magazine/TODAY-Summer-2023.png",
                "externalLink": "https://issuu.com/saintjoesmet/docs/today_june_2023_issu_version",
                "alt": "St. Joes Summer 2023 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign, Adobe Photoshop"
                
            },
            {
                "title": "TODAY Magazine",
                "date": "Fall 2022",
                "description": "The Fall 2022 Edition of the TODAY Magazine was my second run through of the publication, and I had picked up many tricks of the trade since my first edition in the Summer of 2022. As our “Back to School Edition”, it features several articles that update students, alumni, and friends about what Saint Joseph High School had planned for the new year.",
                "slug": "TODAY-fall-2022",
                "imgSmall": "magazine/TODAY-fall-2022.png",
                "imgLarge": "magazine/TODAY-fall-2022.png",
                "externalLink": "https://issuu.com/saintjoesmet/docs/today_magazine_fall_2022_digital_copy_single_page",
                "alt": "St. Joes Fall 2022 TODAY Magazine cover",
                "mediaType": "magazine",
                "skills": "Graphic Design, Magazine Layouts, Magazine Editing, Copywriting, Article Writing, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            }
        ]
    },
    {
        "header": "Video Production",
        "content": [
            {
                "title": "NHRL Recap",
                "date": "2024",
                "description": "For this video, I wanted to take my editing skills to the next level, putting more of my knowledge of color grading, motion graphics, transitions, and storytelling to the test. Recapping the Break Stuff Robotics team’s travels to Norwalk, Connecticut for the NHRL Competition in September, 2024, it showcases the robot Tokyo Drisk’s journey to a 4-2 record that day. It was used on the Break Stuff Robotics YouTube channel. ",
                "slug": "video-nhrl-recap",
                "imgSmall": "video/video-nhrl-small.jpg",
                "imgLarge": "video/video-nhrl-small.jpg",
                "externalLink": "",
                "embed": {
                    "id": "HmStMaq25tQ",
                    "height": "315",
                    "width": "560"
                },
                "alt": "video 2024 robotics nhrl recap",
                "mediaType": "video",
                "skills": "DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Sound Design, Color Grading, Motion Graphics, Animation",
                "software": "Adobe Premiere Pro, Adobe After Effects, Adobe Photoshop"
                
            },
            {
                "title": "Diable Days Trailer",
                "date": "2021",
                "description": "This piece is by far my favorite video I have created due to the fun nature of the topic and the amount of skills I learned from it. For my Magazine Publishing class at RIT, I was tasked with creating a VR magazine experience. I created an article that played this fake movie trailer in VR. I did all of the VFX by hand in Adobe After Effects, trying to replicate a sci-fi/comic book feel. It stars my friends and I, and was one of the last creative projects we worked on together while still in college.  ",
                "slug": "video-diable-days-trailer",
                "imgSmall": "video/video-diable-days-small.png",
                "imgLarge": "video/video-diable-days-large.png",
                "externalLink": "",
                "embed": {
                    "id": "NTJJ5kAFsMY",
                    "height": "315",
                    "width": "560"
                },
                "alt": "video 2021 diable days trailer",
                "mediaType": "video",
                "skills": "Production Management, DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Script Writing, Sound Design, Color Correction/Grading, Asset Management, VFX",
                "software": "Adobe Premiere Pro, Adobe After Effects"
                
            },
            {
                "title": "Giving Day Promo",
                "date": "2024",
                "description": "For Saint Joe’s Giving Day 2024, I was tasked with turning a script my supervisor wrote into a full fledged video production. I took this as a special challenge, where I tried out many new editing techniques and used new camera equipment to turn my vision into an MP4 file. Specifically, I included more motion graphics that I created in Adobe After Effects to add a new visual flair to this project. I filmed a majority of the clips myself, except for the athletics clips that were filmed by one of our videographers. The photo montage pictures were provided by our contracted photographer. ",
                "slug": "st-joes-video-giving-day-2024",
                "imgSmall": "video/video-giving-day-2024-small.png",
                "imgLarge": "video/video-giving-day-2024-small.png",
                "externalLink": "",
                "embed": {
                    "id": "h3B7hbDdJLk",
                    "height": "315",
                    "width": "560"
                },
                "alt": "St. Joes 2024 video giving day",
                "mediaType": "video",
                "skills": "Production Management, DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Color Correction/Grading, Asset Management, Typography Design, Motion Graphics, Animation",
                "software": "Adobe Premiere Pro, Adobe After Effects, Adobe Photoshop"
                
            },
            {
                "title": "Mass Recap",
                "date": "2024",
                "description": "I created this video as a visual recap of Saint Joseph High School’s “Back to School” Mass for the 2024-2025 school year. It was used on our social media platforms where students, parents, alumni, and staff could view it to see how the school comes together as a community for special events.",
                "slug": "video-mass-recap",
                "imgSmall": "video/video-mass-2024-small.jpg",
                "imgLarge": "video/video-mass-2024-small.jpg",
                "externalLink": "",
                "embed": {
                    "id": "oN6AKsDBN3w",
                    "height": "315",
                    "width": "560"
                },
                "alt": "video 2024 mass recap",
                "mediaType": "video",
                "skills": "DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Sound Design, Color Correction/Grading",
                "software": "Adobe Premiere Pro"
                
            },
            {
                "title": "Robotics Highlights",
                "date": "2024",
                "description": "This was a video I created for the Break Stuff Robotics team that I am on. From a regional event at The College of New Jersey, it features highlights and creatives from a 10+ match day of slugfesting from robots Shin Kicker and Tokyo Drisk. Shin Kicker ended up placing second in its weight class. ",
                "slug": "video-robotics-highlights",
                "imgSmall": "video/video-robotics-small.png",
                "imgLarge": "video/video-robotics-small.png",
                "externalLink": "",
                "embed": {
                    "id": "HzKA4uHFi9c",
                    "height": "315",
                    "width": "560"
                },
                "alt": "video 2024 robotics highlights",
                "mediaType": "video",
                "skills": "DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Color Correction/Grading",
                "software": "Adobe Premiere Pro"
                
            },
            {
                "title": "RIT Testimonial",
                "date": "2021",
                "description": "When I was a freelance media artist at RIT, the Department of  Manufacturing and Mechanical Engineering Technology asked me to create a series of video testimonials explaining why students love the program. I coordinated all the shoots, worked with students on their scripts, and edited everything together.  ",
                "slug": "video-rit-testimonial",
                "imgSmall": "video/video-testimonial-small.png",
                "imgLarge": "video/video-testimonial-large.png",
                "externalLink": "",
                "embed": {
                    "id": "1AuG0piuDbs",
                    "height": "315",
                    "width": "560"
                },
                "alt": "video 2021 rit testimonial",
                "mediaType": "video",
                "skills": "Production Management, DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Script Writing, Sound Design, Color Correction/Grading",
                "software": "Adobe Premiere Pro"
                
            }
        ]
    },
    {
        "header": "Social Media",
        "content": [
            {
                "title": "Flock Short",
                "date": "2024",
                "description": "The Flock student fan section at Saint Joe’s is without a doubt one of the most iconic parts of the school’s culture, and I wanted to capture that essence in video format for our social media channels. I recorded this footage at our Friday Night Lights football game, and used editing and color grading to show off the school spirit. It can be seen on @stjoesmetuchen on Instagram, Facebook, Twitter, and TikTok. ",
                "slug": "st-joes-social-flock",
                "imgSmall": "social/social-flock-small.jpg",
                "imgLarge": "social/social-flock-small.jpg",
                "externalLink": "",
                "embed": {
                    "id": "HcTPLqZzYko",
                    "height": "315",
                    "width": "560"
                },
                "alt": "St. Joes 2024 social flock",
                "mediaType": "video",
                "skills": "DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Color Correction/Grading, Social Media Management",
                "software": "Adobe Premiere Pro"
                
            },
            {
                "title": "Wrestling Post",
                "date": "2022",
                "description": "When the Saint Joseph High School wrestling team was heading to the Beast of the East tournament, I created this graphic to hype up the event to our student fanbase. This graphic was very fun to make because of how many different styles and effects went into the photo manipulation. It can be seen on @stjoesmetuchen on Instagram, Facebook, and Twitter. ",
                "slug": "st-joes-social-wrestling",
                "imgSmall": "social/wrestling-social-small.png",
                "imgLarge": "social/wrestling-social-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 social wrestling",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Photo Manipulation, Social Media Management",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Bands Promo",
                "date": "2024",
                "description": "Every year, Saint Joe’s hosts a Battle of the Bands competition for student bands from our school and ones in the surrounding area. I filmed the full show in 2023, and used the footage to create this teaser for the 2024 rendition. I experimented a lot with the looks in this piece, especially the colors and textures, using visuals from the indie music/DIY scene as inspiration. ",
                "slug": "st-joes-social-bands",
                "imgSmall": "video/video-bands-small.png",
                "imgLarge": "video/video-bands-small.png",
                "externalLink": "",
                "embed": {
                    "id": "lyKMfJOHEqI",
                    "height": "315",
                    "width": "560"
                },
                "alt": "St. Joes 2024 video battle of the bands",
                "mediaType": "video",
                "skills": "DSLR Operation (Canon Rebel SL3), Videography, Video Editing, Color Correction/Grading, Typography Design",
                "software": "Adobe Premiere Pro"
                
            },
            {
                "title": "GMC Red Titles",
                "date": "2024",
                "description": "When three of Saint Joseph High School’s winter sports teams won the GMC Red title in one night, I created a social media graphic to promote the victories. The photos were taken and edited when I ran our sports media day. It can be seen on @stjoesmetuchen on Instagram, Facebook, and Twitter.  ",
                "slug": "st-joes-social-gmc-red",
                "imgSmall": "social/gmc-red-social-small.png",
                "imgLarge": "social/gmc-red-social-large.png",
                "externalLink": "",
                "alt": "St. Joes 2024 social gmc red",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Social Media Management, DSLR Operation (Canon Rebel SL3), Photo Processing, Studio Photography, Photo Manipulation ",
                "software": "Canva, Adobe Lightroom"
                
            },
            {
                "title": "Campus Store",
                "date": "2024",
                "description": "When Saint Joe’s got on TikTok, I started to think of new ways I could promote school content using short form videos. This ad, created to promote the numerous types of merchandise available at the Campus Store, uses this style of videography in a concise and fun way.",
                "slug": "st-joes-social-campus-store",
                "imgSmall": "social/store-social-small.jpg",
                "imgLarge": "social/store-social-small.jpg",
                "externalLink": "",
                "embed": {
                    "id": "8WSMEy6PJzI",
                    "height": "315",
                    "width": "560"
                },
                "alt": "social campus store teaser",
                "mediaType": "video",
                "skills": "Videography, Video Editing, Social Media Management",
                "software": "CapCut"
                
            },
            {
                "title": "Open House",
                "date": "2024",
                "description": "This ad was created to promote the 2024 Saint Joe’s Open House, where we welcome prospective families to experience what we have to offer. It uses a modern design to capture the essence of the event and available opportunities you could receive by attending. It was one part of a larger marketing effort to promote our biggest showcase of the year. ",
                "slug": "st-joes-social-open-house",
                "imgSmall": "social/open-house-social-small.jpg",
                "imgLarge": "social/Open House Ads Social 2024.jpg",
                "externalLink": "",
                "alt": "St. Joes 2024 open house",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Social Media Management ",
                "software": "Canva"
                
            }
        ]
    },
    {
        "header": "Motion Graphics",
        "content": [
            {
                "title": "Sports Report Intro",
                "date": "2024",
                "description": "This was a project I took on based on a very vivid idea I had when working with our Winter Media Day photos. I cropped all the images out in Photoshop and used After Effects to create a 3D space with all the assets to simulate a studio space. This project was a ton of fun because of how much I learned about the After Effects animation process. I was even able to take photos around campus, such as the gym floor, to include in the 3D space. I plan on using this as an animated intro for a series on our social media. ",
                "slug": "motion-graphics-sports-report",
                "imgSmall": "motion-graphics/motion-graphics-sports-report-small.png",
                "imgLarge": "motion-graphics/motion-graphics-sports-report-small.png",
                "externalLink": "",
                "embed": {
                    "id": "dzUC5msAK5o",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics 2024 st. joes sports report intro",
                "mediaType": "video",
                "skills": "Asset Management, VFX, Motion Graphics, Animation",
                "software": "Adobe After Effects, Adobe Photoshop"
                
            },
            {
                "title": "Fight Card",
                "date": "2024",
                "description": "This piece is a component of a larger video project, recapping and highlighting Break Stuff Robotics’ matches from the NHRL September 2024 3lb competition. I designed these graphics in Photoshop to showcase which robots Tokyo Drisk would be going against, and animated it in Adobe After Effects. In the full video, it is used as a transition clip between match sections. ",
                "slug": "motion-graphics-robotics-fight-card",
                "imgSmall": "motion-graphics/motion-graphics-fight-card-small.jpg",
                "imgLarge": "motion-graphics/motion-graphics-fight-card-small.jpg",
                "externalLink": "",
                "embed": {
                    "id": "A_IAcURqHsM",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics break stuff robotics fight card",
                "mediaType": "video",
                "skills": "Motion Graphics, Asset Management, Typography Design, Sound Design",
                "software": "Adobe After Effects, Adobe Photoshop"
                
            },
            {
                "title": "Student Government",
                "date": "2021",
                "description": "When I worked for RIT Student Government as a media artist, I created an intro animation using the SG logo. It was used at the beginning of SG videos on their website and social media. A colleague created the vector graphic and I used After Effects to animate it. ",
                "slug": "motion-graphics-sg-intro",
                "imgSmall": "motion-graphics/motion-graphics-sg-small.png",
                "imgLarge": "motion-graphics/motion-graphics-sg-large.png",
                "externalLink": "",
                "embed": {
                    "id": "shq_JdCsWQ4",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics 2021 rit sg intro",
                "mediaType": "video",
                "skills": "Asset Management, VFX, Graphic Design, Typography Design, Motion Graphics, Animation",
                "software": "Adobe After Effects"
                
            },
            {
                "title": "Giving Day Outro",
                "date": "2024",
                "description": "For Saint Joe’s Giving Day 2024, I created this motion graphic to serve as the outro for the video components created to promote the day on our social media platforms. I animated it using After Effects and used Premiere Pro to add it to our videos. Additionally, I used photos I took throughout the school year.  ",
                "slug": "motion-graphics-giving-day-outro",
                "imgSmall": "motion-graphics/motion-graphics-giving-day-small.png",
                "imgLarge": "motion-graphics/motion-graphics-giving-day-small.png",
                "externalLink": "",
                "embed": {
                    "id": "zacB80xavYY",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics 2024 st. joes giving day outro",
                "mediaType": "video",
                "skills": "Asset Management, Graphic Design, Typography Design, Motion Graphics, Studio Photography",
                "software": "Adobe After Effects"
                
            },
            {
                "title": "Robotics Outro",
                "date": "2024",
                "description": "I created this animated graphic for the Break Stuff Robotics team which I am a part of. It is used as the outro for videos I produce for the team. I used After Effects to animate the initial vector logo I created when I first joined, and added sound effects to make it more immersive.  ",
                "slug": "motion-graphics-robotics",
                "imgSmall": "motion-graphics/motion-graphics-robotics-small.png",
                "imgLarge": "motion-graphics/motion-graphics-robotics-small.png",
                "externalLink": "",
                "embed": {
                    "id": "YPg1ggXSsVU",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics break stuff robotics outro",
                "mediaType": "video",
                "skills": "Asset Management, Vector Design, Typography Design, Motion Graphics, Sound Design",
                "software": "Adobe After Effects, Adobe Illustrator"
                
            },
            {
                "title": "Falcon Score Report",
                "date": "2023",
                "description": "For Saint Joseph High School’s Spring Media Day 2023, we brought in a professional sports videographer to get clips of the athletes. Throughout the season I used these clips in the Falcon Score Reports to recap the previous day’s athletics scores on social media. It can be seen on @stjoesmetuchen on Instagram, Facebook, and Twitter. ",
                "slug": "motion-graphics-report",
                "imgSmall": "motion-graphics/motion-graphics-report-small.png",
                "imgLarge": "motion-graphics/motion-graphics-report-large.png",
                "externalLink": "",
                "embed": {
                    "id": "aA0krL3aQrY",
                    "height": "315",
                    "width": "560"
                },
                "alt": "motion graphics 2023 st. joes falcon score report",
                "mediaType": "video",
                "skills": "Asset Management, Graphic Design, Typography Design, Motion Graphics",
                "software": "Adobe Premiere Pro"
                
            }
        ]
    },
    {
        "header": "Photo Manipulation",
        "content": [
            {
                "title": "Christmas Card",
                "date": "2023",
                "description": "The cover of the Saint Joseph High School 2023 Christmas card was a really fun project to work on. I was asked to take a summertime photo from a freelance photographer and make it fit the winter-time feel and radiance of a Christmas display. Through numerous editing techniques and revisions, the final image captures the Christmas spirit in an entirely new experience. ",
                "slug": "st-joes-photo-manipulation-christmas",
                "imgSmall": "photo-manipulation/christmas-photo-manipulation-small.jpg",
                "imgLarge": "photo-manipulation/christmas-photo-manipulation-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2023 photo christmas card",
                "mediaType": "magazine",
                "skills": "Photo Manipulation, Photo Processing",
                "software": "Adobe Lightroom, Adobe Photoshop"
                
            },
            {
                "title": "Viewbook Cover",
                "date": "2024",
                "description": "Every year I look forward to designing our newest viewbook cover because of the artistic challenges that I meet. I often use this opportunity to turn a concept into a full design, such as this year’s marketing theme “Building Men of the Future.” To flesh this out, I used photos from our most recent graduating class as freshman and as seniors to show the progression of young students developing into young men. ",
                "slug": "st-joes-photo-manipulation-viewbook",
                "imgSmall": "photo-manipulation/viewbook-cover-photo-manipulation-small.jpg",
                "imgLarge": "photo-manipulation/viewbook-cover-photo-manipulation-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2024 viewbook cover",
                "mediaType": "magazine",
                "skills": "Photo Manipulation",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "SJ Universe",
                "date": "2022",
                "description": "This image was created to be the cover of the 2022 Admissions Viewbook. I processed photos in Adobe Lightroom and created this compilation in Adobe Photoshop. It features photos from throughout the previous school year taken by myself and a number of other photographers. ",
                "slug": "st-joes-photo-manipulation-sj-universe",
                "imgSmall": "photo-manipulation/sj-universe-photo-manipulation-small.jpg",
                "imgLarge": "photo-manipulation/sj-universe-photo-manipulation-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2022 photo sjuniverse",
                "mediaType": "magazine",
                "skills": "Photo Manipulation, Photo Processing",
                "software": "Adobe Lightroom, Adobe Photoshop"
                
            }
        ]
    },
    {
        "header": "Photography",
        "content": [
            {
                "title": "Celebratory Selfie",
                "date": "2022",
                "description": "This photo was taken at the 2022 Commencement and Graduation for the seniors at Saint Joseph High School, showcasing a group of graduates celebration with a pre-ceremony selfie. It was used as the inside cover of the Summer 2022 edition of TODAY Magazine.  ",
                "slug": "st-joes-photos-graduation",
                "imgSmall": "photography/photos-graduation-small.png",
                "imgLarge": "photography/photos-graduation-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 photo graduation",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Processing, Event Photography",
                "software": "Adobe Lightroom"
                
            },
            {
                "title": "Statue Shining",
                "date": "2024",
                "description": "For the 2024-2025 Annual Report publication, I wanted to create several options for cover designs featuring iconic parts of the Saint Joseph High School campus. Several locations were photographed, but this shot of the Saint Joseph statue prominently at the front of the campus stood out to me the most. I waited until later in the day when the sun would be setting just behind it to optimize the artistic value, and I used Adobe Lightroom to grade the colors to really pop. ",
                "slug": "st-joes-photos-statue",
                "imgSmall": "photography/photos-statue-small.jpg",
                "imgLarge": "photography/photos-statue-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2024 photo statue",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Processing, Color Correction/Grading",
                "software": "Adobe Lightroom"
                
            },
            {
                "title": "Sports Media Day",
                "date": "2023",
                "description": "For every athletic season at Saint Joseph High School, my office coordinates a sports media day for varsity players. These photos are used across a wide variety of outlets, including social media, our school website, and publications. I acted as the primary photographer and editor capturing each sport, including this shot from a basketball team member. ",
                "slug": "st-joes-photos-basketball",
                "imgSmall": "photography/photos-basketball-small.png",
                "imgLarge": "photography/photos-basketball-large.png",
                "externalLink": "",
                "alt": "St. Joes 2023 photo basketball",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Processing, Studio Photography",
                "software": "Adobe Lightroom"
                
            },
            {
                "title": "Science Award",
                "date": "2024",
                "description": "During the 2024 school year, a junior at Saint Joe’s won a prestigious science award for the state of New Jersey, and I set up this photo shoot with him to use as a promotional image for an article written on his achievement. I love staged photography because it allows me to control the scene to capture an idea, and my coworker in the science department was kind enough to lend the space and materials to make it look official!  ",
                "slug": "st-joes-photos-science",
                "imgSmall": "photography/photos-science-small.jpg",
                "imgLarge": "photography/photos-science-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2024 photo science",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Processing, Studio Photography",
                "software": "Adobe Lightroom"
                
            },
            {
                "title": "Pondering Portrait",
                "date": "2019",
                "description": "This photo was taken of a classmate in my Imaging class at RIT. We were learning about the equipment and processing required for portrait photography as part of a class project. ",
                "slug": "rit-portrait",
                "imgSmall": "photography/photos-portrait-small.png",
                "imgLarge": "photography/photos-portrait-large.png",
                "externalLink": "",
                "alt": "rit portrait",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Processing, Studio Photography",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Cabaret Performance",
                "date": "2022",
                "description": "This photo was taken at the first ever Saint Joe’s Cabaret put on by the Saint Joseph Theatre Company. I photographed the whole event for yearbook and social media purposes, including a shot from a student solo performance.  ",
                "slug": "st-joes-photos-cabaret",
                "imgSmall": "photography/photos-cabaret-small.png",
                "imgLarge": "photography/photos-cabaret-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 photo cabaret",
                "mediaType": "magazine",
                "skills": "DSLR Operation (Canon Rebel SL3), Photo Manipulation, Photo Processing, Event Photography",
                "software": "Adobe Lightroom, Adobe Photoshop"
                
            }
        ]
    },
    {
        "header": "Vector & Logos",
        "content": [
            {
                "title": "Bar Logo",
                "date": "2023",
                "description": "DDawg’s Sunnyside Tavern is a personal project I took on when I started renovating my basement, turning it into a bar/hangout space for myself and friends that came over. I created the logo to be printed on miscellaneous trinkets, including coasters and napkins. What bar is complete without a cool logo and custom items?  ",
                "slug": "freelance-vector-bar",
                "imgSmall": "vector/vector-bar-v2-small.jpg",
                "imgLarge": "vector/vector-tavern-v2-large.jpg",
                "externalLink": "",
                "alt": "freelance 2023 vector bar",
                "mediaType": "magazine",
                "skills": "Logo Design, Vector Design, Typography Design",
                "software": "Adobe Illustrator"
                
            },
            {
                "title": "Robotics Sticker",
                "date": "2024",
                "description": "When attending combat robotics events with the Break Stuff Robotics team I am on, we like to hand out various stickers and giveaway materials. For this piece, I used the tools available in Adobe Illustrator to create this vector rendition of one of the robots, the 3lb Tokyo Drisk, and had it printed out. Other competitors and spectators visiting the events came by our table and picked one up.",
                "slug": "freelance-vector-robot-sticker",
                "imgSmall": "vector/vector-tokyo-small.jpg",
                "imgLarge": "vector/vector-tokyo-large.png",
                "externalLink": "",
                "alt": "freelance 2024 vector robotics sticker",
                "mediaType": "magazine",
                "skills": "Vector Design, Illustration",
                "software": "Adobe Illustrator"
                
            },
            {
                "title": "Robotics Logo",
                "date": "2023",
                "description": "This logo was created for the Break Stuff Robotics team, with such hit combat robots as Shin Kicker, Tokyo Drisk, and Jersey Turnpike that compete in local tournaments in the Tri-State area. The logo was used on items such as custom stickers. ",
                "slug": "freelance-vector-robotics",
                "imgSmall": "vector/vector-robotics-small.png",
                "imgLarge": "vector/vector-robotics-large.png",
                "externalLink": "",
                "alt": "freelance 2023 vector robotics",
                "mediaType": "magazine",
                "skills": "Logo Design, Vector Design, Typography Design",
                "software": "Adobe Illustrator"
                
            },
            {
                "title": "Keyframe Heroes Logo",
                "date": "2020",
                "description": "Keyframe Heroes was the name of an old animation I made back in middle school. In college, I decided to apply some of my more current design skills to create a logo for it, with the hopes of one day using it on a comic book version of the story I originally envisioned. I wanted to capture the comic book essence by using thick black strokes and a paper texture.  ",
                "slug": "freelance-logo-keyframe-heroes",
                "imgSmall": "vector/vector-keyframe-small.jpg",
                "imgLarge": "vector/vector-keyframe-large.png",
                "externalLink": "",
                "alt": "freelance 2020 logo keyframe heroes",
                "mediaType": "magazine",
                "skills": "Logo Design, Vector Design, Typography Design",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Sci-Fi Logo",
                "date": "2023",
                "description": "In 2023 I went on a kick of designing text-based logos for book ideas I had. Once I got the creative juices flowing, I designed this logo for a science fiction series I envisioned called Sands of Kings. It would follow a group of leaders who used fantastic superpowers to explore the galaxy, in a hybrid of science elements and the supernatural. Using elegant gold and purple colors to accompany the sand texture, it can be considered a literal interpretation of the name. ",
                "slug": "freelance-vector-sands-of-kings",
                "imgSmall": "vector/vector-sands-small.jpg",
                "imgLarge": "vector/vector-sands-large.png",
                "externalLink": "",
                "alt": "freelance 2023 vector sands of kings",
                "mediaType": "magazine",
                "skills": "Logo Design, Vector Design, Typography Design",
                "software": "Adobe Illustrator"
                
            },
            {
                "title": "Diable Days Logo",
                "date": "2023",
                "description": "Diable Days was a creative project I originally created as a concept trailer for a film back during my time at RIT. The trailer was used for a class project, but in 2023 I revisited the idea to make more conceptual materials, including some character drawings and this logo. It was really fun to bring the ideas back and reimagine them with my improved skill set.  ",
                "slug": "freelance-vector-diable",
                "imgSmall": "vector/vector-diable-small.png",
                "imgLarge": "vector/vector-diable-large.png",
                "externalLink": "",
                "alt": "freelance 2023 vector diable days",
                "mediaType": "magazine",
                "skills": "Logo Design, Vector Design, Typography Design",
                "software": "Adobe Illustrator"
                
            }

        ]
    },
    {
        "header": "Illustration",
        "content": [
            {
                "title": "Fantasy Cover",
                "date": "2024",
                "description": "As I grew into adulthood, I wanted to rekindle my love of writing by creating a fantasy prose zine, entitled “Except If You Are Nodecrazed” which I wrote, designed, and had ordered from an online print vendor. It follows a lowly psychic “Nodecrazed” who explores the vast world within the mind of a godlike creature known as “The Node.” I drew the cover in Adobe Photoshop and have loved sharing it with my like-minded book lovers! ",
                "slug": "illustration-fantasy-cover",
                "imgSmall": "illustration/nodecrazed-small.jpg",
                "imgLarge": "illustration/nodecrazed-large.jpg",
                "externalLink": "",
                "alt": "2024 illustration fantasy zine cover",
                "mediaType": "magazine",
                "skills": "Illustration, Graphic Design, Typography Design, Print Production",
                "software": "Adobe Photoshop, Adobe InDesign"
                
            },
            {
                "title": "God Emperor",
                "date": "2024",
                "description": "As an avid reader, one of my favorite novel series of all time is Frank Herbert’s Dune, particularly the fourth entry God Emperor of Dune. As I practiced my illustration skills more, I wanted to create my own rendition of the half-human, half-sandworm main character, Leto Atreides II. I spent a lot of time learning digital painting techniques in Adobe Photoshop to create this piece, and I am happy to have prepared it for print to hang up! One of my favorite parts about reading is seeing what I and my fellow book lovers come up with translating words into art.  ",
                "slug": "illustration-god-emperor",
                "imgSmall": "illustration/god-emperor-small.jpg",
                "imgLarge": "illustration/god-emperor-large.jpg",
                "externalLink": "",
                "alt": "2024 illustration god emperor of dune",
                "mediaType": "magazine",
                "skills": "Illustration, Print Production",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Luffy Fan Art",
                "date": "2023",
                "description": "Reading manga is one of my favorite activities, and many volumes have inspired me to pursue my own renditions of fan art. I drew this piece in Adobe Photoshop around the time when Monkey D. Luffy of One Piece unlocked a new form that took the manga community by storm. I also enjoyed adding a graphic design touch to it with the layering of typography in the background. ",
                "slug": "illustration-one-piece",
                "imgSmall": "illustration/luffy-small.jpg",
                "imgLarge": "illustration/luffy-large.jpg",
                "externalLink": "",
                "alt": "2024 illustration one piece fan art",
                "mediaType": "magazine",
                "skills": "Illustration, Graphic Design, Typography Design",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "The Bird Poster",
                "date": "2023",
                "description": "This poster is based on one of my characters from the fake movie trailer I made for a class in college: Diable Days. The original trailer was made in 2021, but in 2023 I revisited the concept and illustrated one of the main characters, The Bird, in Photoshop. I created the logo and the background of the poster in Adobe Illustrator. This was a fun project to work on, as I got to learn more about illustration while translating a live action character into 2D. ",
                "slug": "illustration-the-bird",
                "imgSmall": "illustration/illustration-bird-small.png",
                "imgLarge": "illustration/illustration-bird-large.png",
                "externalLink": "",
                "alt": "2023 illustration diable days the bird",
                "mediaType": "magazine",
                "skills": "Illustration, Graphic Design, Typography Design",
                "software": "Adobe Photoshop, Adobe Illustrator"
                
            },
            {
                "title": "Robe-RT Poster",
                "date": "2023",
                "description": "This poster is based on one of my characters from the fake movie trailer I made for a class in college: Diable Days. The original trailer was made in 2021, but in 2023 I revisited the concept and illustrated one of the main characters, Robe-RT, in Photoshop. I created the logo and the background of the poster in Adobe Illustrator. This was a fun project to work on, as I got to learn more about illustration while translating a live action character into 2D. ",
                "slug": "illustration-robe-rt",
                "imgSmall": "illustration/illustration-robe-rt-small.png",
                "imgLarge": "illustration/illustration-robe-rt-large.png",
                "externalLink": "",
                "alt": "2023 illustration diable days robe-rt",
                "mediaType": "magazine",
                "skills": "Illustration, Graphic Design, Typography Design",
                "software": "Adobe Photoshop, Adobe Illustrator"
                
            },
            {
                "title": "Hooch Poster",
                "date": "2023",
                "description": "This poster is based on one of my characters from the fake movie trailer I made for a class in college: Diable Days. The original trailer was made in 2021, but in 2023 I revisited the concept and illustrated one of the main characters, Hooch, in Photoshop. I created the logo and the background of the poster in Adobe Illustrator. This was a fun project to work on, as I got to learn more about illustration while translating a live action character into 2D. ",
                "slug": "illustration-hooch",
                "imgSmall": "illustration/illustration-hooch-small.png",
                "imgLarge": "illustration/illustration-hooch-large.png",
                "externalLink": "",
                "alt": "2023 illustration diable days hooch",
                "mediaType": "magazine",
                "skills": "Illustration, Graphic Design, Typography Design",
                "software": "Adobe Photoshop, Adobe Illustrator"
                
            }
        ]
    },
    {
        "header": "Print Projects",
        "content": [
            {
                "title": "Campus Store Ad",
                "date": "2023",
                "description": "This ad for the Saint Joseph High School Campus Store was originally created as a page in the Fall 2023 edition of the TODAY Magazine, but has been reused and sometimes reformatted to fit a variety of outputs. Additionally, I took the photos of the store and the beverage accessories. It was very fun to create a design that promoted a wide variety of products sold at the store! ",
                "slug": "st-joes-print-store",
                "imgSmall": "print/print-campus-store-small.png",
                "imgLarge": "print/print-campus-store-large.png",
                "externalLink": "",
                "alt": "St. Joes 2023 print campus store ad",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production, Magazine Editing, Magazine Layouts, DSLR Operation (Canon Rebel SL3), Photo Processing, Photo Manipulation",
                "software": "Adobe InDesign, Adobe Lightroom, Adobe Photoshop"
                
            },
            {
                "title": "Socks Campaign Postcard",
                "date": "2023",
                "description": "This postcard was created for a “rock the socks” campaign at Saint Joseph High School that was targeted towards a young alumni audience. The card was printed and mailed out, featuring renderings of two sock designs provided by our producer. Out of all the postcards I have designed for Saint Joe’s, this one has always stuck with me because of the creative typography I wanted to instill in the piece.  ",
                "slug": "st-joes-print-socks",
                "imgSmall": "print/print-socks-small.png",
                "imgLarge": "print/print-socks-large-v2.png",
                "externalLink": "",
                "alt": "St. Joes 2023 print socks campaign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Golf Classic Postcard",
                "date": "2024",
                "description": "This postcard was created and mailed to Saint Joseph High School’s constituents as a “Save the Date” for the 2024 Falcon Golf Classic. It features carefully crafted typography with the visual flare of a snapshot of a student golfer. It served as the first marketing piece for the event.  ",
                "slug": "st-joes-print-golf-card",
                "imgSmall": "print/print-golf-std-small-v2.png",
                "imgLarge": "print/print-golf-std-large-v2.png",
                "externalLink": "",
                "alt": "St. Joes 2024 print golf postcard",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production, Photo Manipulation",
                "software": "Adobe InDesign, Adobe Photoshop"
                
            },
            {
                "title": "Golf Classic Flyer",
                "date": "2023",
                "description": "The Falcon Golf Classic is one of Saint Joseph High School’s biggest annual fundraisers, and this flyer was created as a “Save the Date” with more information than the pairing postcard. It was printed and distributed to local constituents at other in-person events that led up to the actual golf outing. Design-wise, it pairs with a “Save the Date” postcard that was printed and mailed to our constituent base of over 10,000 people.  ",
                "slug": "st-joes-print-golf-flyer",
                "imgSmall": "print/print-golf-flyer-small.png",
                "imgLarge": "print/print-golf-flyer-large.png",
                "externalLink": "",
                "alt": "St. Joes 2023 print golf flyer",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Gala Magnet Mailer",
                "date": "2024",
                "description": "The first magnet I have ever designed, this piece served as a “Save the Date” mailer for Saint Joseph High School’s 2024 Green Tie Gala fundraiser. It features a beautiful snapshot of the Liberty House in Jersey City, provided by the venue, as well as the typographic stylings of the Saint Joe’s signature typeface family.  ",
                "slug": "st-joes-print-gala-magnet",
                "imgSmall": "print/print-gala-smallv4.png",
                "imgLarge": "print/print-gala-large-v2.png",
                "externalLink": "",
                "alt": "St. Joes 2024 print gala magnet",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production",
                "software": "Adobe InDesign"
                
            },
            {
                "title": "Open House Ad",
                "date": "2024",
                "description": "Throughout the academic year at Saint Joe’s, I often create ads designed for print in local magazines, newspapers, and community publications. In the Fall of 2024 I edited this ad for our upcoming open house, telling the story of the school using the year’s “Building Men of the Future” marketing campaign branding. I also took the photo used at the previous year’s graduation.",
                "slug": "st-joes-open-house-ad",
                "imgSmall": "print/print-open-house-small.jpg",
                "imgLarge": "print/print-open-house-large.jpg",
                "externalLink": "",
                "alt": "St. Joes 2024 open house ad",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Print Production, DSLR Operation (Canon Rebel SL3), Photo Processing",
                "software": "Canva, Adobe Lightroom"
                
            }
        ]
    },
    {
        "header": "Display Graphics",
        "content": [
            {
                "title": "Gala Jumbotron",
                "date": "2022",
                "description": "This graphic was put on the jumbotron screen across from the Heldrich Hotel in New Brunswick, NJ during Saint Joseph High School’s Green Tie Gala fundraiser. It was used to congratulate Kevin M. Ryan, CEO of Covenant House International, who was the 2022 honoree at the gala. ",
                "slug": "st-joes-sign-gala",
                "imgSmall": "signs/gala-sign-small.png",
                "imgLarge": "signs/gala-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 gala sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Lent Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. I often create seasonal and holiday-based signs for the school, and this one was used to celebrate the beginning of Lent. I created the ash cross in Adobe Illustrator. ",
                "slug": "st-joes-sign-lent",
                "imgSmall": "signs/lent-sign-small.png",
                "imgLarge": "signs/lent-sign-largev2.png",
                "externalLink": "",
                "alt": "St. Joes 2022 lent sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Adobe Illustrator, Adobe Photoshop"
                
            },
            {
                "title": "NBA Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to congratulate Karl Anthony Towns, a graduate from Saint Joe’s who has a career in the NBA and notably earned the title of All Star.  ",
                "slug": "st-joes-sign-NBA",
                "imgSmall": "signs/kat-sign-small.png",
                "imgLarge": "signs/kat-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 NBA sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Photo Manipulation",
                "software": "Adobe Photoshop"
                
            },
            {
                "title": "Advent Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to commemorate the life of Brother Ronald Cairns, S.C., a longtime Partner in Mission who had recently passed away. The annual Advent Community Mass was held in recognition of his life, and the graphic was used to promote the mass.",
                "slug": "st-joes-sign-advent",
                "imgSmall": "signs/advent-sign-small.png",
                "imgLarge": "signs/advent-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Advent sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Wrestling Display Sign",
                "date": "2023",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. It was used to celebrate the accomplishments of our wrestling team for winning a county championship. ",
                "slug": "st-joes-sign-wrestling",
                "imgSmall": "signs/wrestling-sign-small.png",
                "imgLarge": "signs/wrestling-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2023 Wrestling sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design",
                "software": "Canva"
                
            },
            {
                "title": "Football Display Sign",
                "date": "2022",
                "description": "This graphic was put up on Saint Joseph High School’s electronic display sign in the front of the campus. As a high school, we often celebrate our students’ accomplishments with recognition on the display sign. This was one entry in a series of promoting our senior athletes who signed on to play at the collegiate level.  ",
                "slug": "st-joes-sign-football",
                "imgSmall": "signs/football-sign-small.png",
                "imgLarge": "signs/football-sign-large.png",
                "externalLink": "",
                "alt": "St. Joes 2022 Football sign",
                "mediaType": "magazine",
                "skills": "Graphic Design, Typography Design, Photo Manipulation",
                "software": "Adobe Photoshop"
                
            }
        ]
    }
]
