{
    "name": "Dylan Hollender",
    "pronouns": "(he/him)",
    "leftBlock": [
        {
            "header": "",
            "subBlocks": [
                {
                    "subHeader": "Contact Information",
                    "text": [
                        "Phone: (908) 255-0271",
                        "Email: hollenderdylan@gmail.com"
                    ]
                },
                {
                    "subHeader": "Profiles",
                    "text": [
                        {
                            "category": "Portfolio: ",
                            "string": "DDawgDesigns",
                            "url": "https://www.ddawgdesigns.com"
                        },
                        {
                            "category": "LinkedIn ",
                            "string": "Profile",
                            "url": "https://www.linkedin.com/in/dylan-hollender-0a18b9150/"
                        }
                    ]
                },
                {
                    "subHeader": "Education",
                    "text": [
                        "Bachelor of Science in Media Arts and Technology from the Rochester Insitute of Technology in Rochester, NY.",
                        "Graduation Date: May 2021",
                        "Graduated as an Outstanding Undergraduate Scholar in the top 1% of the university."
                    ]
                },
                {
                    "subHeader": "Summary",
                    "text": [
                        "I am a multimedia artist fueled by a passion for the visual arts. ",
                        "I have hands on experience leading crossmedia projects from inception to completion, including digital and print magazine publications, video series for communications and fundraising, social media management and more.",
                        "Much of my background is finding the overlap between art and technology, applying knowledge of both fields to create unique and powerful viewing experiences. ",
                        "I see every project I take on as a chance to learn more about media and fine tune my skills."
                    ]
                }
            ]
        }
    ],
    "rightBlock": [
        {
            "header": "Work Experience",
            "subBlocks": [
                {
                    "subHeader": "Communications and Marketing Coordinator at Saint Joseph High School (February 2022-Present)",
                    "text": [
                        "Six months into my professional career at Saint Joseph High School, I was promoted to Communications and Marketing Coordinator in the Advancement Office. Here, I lead all of the school’s design projects, including the biannual TODAY Magazine, Annual Report, Admissions Viewbook, and Ad Journals for the Green Tie Gala and Golf Classic.",
                        "I manage the school’s social media platforms and website, creating photo, video, and graphic content for all channels. Additionally, I teach the Advanced Journalism course where I manage a small team of student media artists, helping them learn more about the field while having them assist in high-end, real world communications projects. "
                    ]
                },
                {
                    "subHeader": "Media Relations Coordinator at Saint Joseph High School (August 2021-February 2022)",
                    "text": [
                        "When I was first hired at Saint Joseph High School, I worked directly under the Director of Admissions, helping aid admissions campaigns using my broad set of skills in media production. This included creation of promotional materials and managing event registrations. Within six months, I was promoted to working as the lead designer in the Advancement Office."
                    ]
                },
                {
                    "subHeader": "Freelance Media Artist at Rochester Institute of Technology (October 2020-May 2021)",
                    "text": [
                        "During my senior year at RIT, I worked as a freelance media artist for various departments on campus. This included video production, event photography, creating branded motion graphics, and designing posters and social media graphics, all within the RIT brand guidelines. "
                    ]
                }
            ]
        }
    ],
    "skillsBlock" : [
        {
            "header": "Skills",
            "subBlocks": [
                {
                    "subHeader": "Software",
                    "text": [
                        "Adobe InDesign, Adobe Premiere Pro, Adobe Photoshop, Adobe Lightroom, Adobe Animate, Adobe AfterEffects, Adobe Illustrator, Adobe Media Encoder, Adobe Acrobat, Canva, Finalsite CMS, Microsoft Office, Google Suite, Figma."
                    ]
                },
                {
                    "subHeader": "Creative Skills",
                    "text": [
                        "Magazine Publishing, Graphic Design, Video Editing, Film Production, Photography, Photo Manipulation, DSLR Operation, Script Writing, Copywriting, Motion Graphics, Audio Processing/Editing."
                    ]
                },
                {
                    "subHeader": "Other",
                    "text": [
                        "Communication, Organization, Social Media Management, Advertising, Public Relations, Production Workflow, Project Management, Print Production, and a Positive Attitude :)"
                    ]
                }
            ]
        }
    ]
}