{
    "name": "Dylan Hollender",
    "pronouns": "(he/they)",
    "leftBlock": {
        "header": "",
        "subBlocks": [
            {
                "subHeader": "Contact Information",
                "styleClass": "resume-contact",
                "text": [
                    "Phone: (908) 255-0271",
                    "Email: hollenderdylan@gmail.com"
                ]
            },
            {
                "subHeader": "Profiles",
                "styleClass": "resume-url",
                "text": [
                    {
                        "category": "Portfolio: ",
                        "string": "DDawgDesigns",
                        "url": "https://www.ddawgdesigns.com"
                    },
                    {
                        "category": "LinkedIn: ",
                        "string": "Profile",
                        "url": "https://www.linkedin.com/in/dylan-hollender-0a18b9150/"
                    }
                ]
            },
            {
                "subHeader": "Education",
                "styleClass": "allow-newline",
                "text": [
                    "Bachelor of Science in Media Arts and Technology from the Rochester Institute of Technology in Rochester, NY.",
                    "Graduation Date: May 2021",
                    "Graduated as an Outstanding Undergraduate Scholar in the top 1% of the university."
                ]
            },
            {
                "subHeader": "Summary",
                "styleClass": "allow-newline",
                "text": [
                    "I am a multimedia artist fueled by a passion for the visual arts in all its beautiful forms. ",
                    "I have hands on experience leading cross-media projects from inception to completion, including digital and print magazine publications, video series for communications and fundraising, social media management and more.",
                    "Much of my background is finding and exploring the overlap between art and technology, applying knowledge of both fields to create unique and powerful viewing experiences. ",
                    "Every project I work on is a new and innovative way to tell the exciting stories of my clients."
                ]
            }
        ]
    },
    "rightBlock": {
        "header": "Work Experience",
        "subBlocks": [
            {
                "subHeader": "Communications and Marketing Coordinator at Saint Joseph High School (February 2022-August 2025)",
                "text": [
                    "In the Office of Advancement, I acted as the lead designer. Here, I ensured all communications and marketing campaigns adhered to a cohesive brand identity. This included creating graphic designs for print and digital collateral, producing high-end video content for web and social, and specializing in publication design for our bi-annual TODAY Magazine and yearbook.",
                    "Additionally, I created community content for and monitored the school website, Instagram, Facebook, X and TikTok accounts. "
                ]
            },
            {
                "subHeader": "Media Relations Coordinator at Saint Joseph High School (August 2021-February 2022)",
                "text": [
                    "Here, I worked directly under the Director of Admissions, helping aid department campaigns using my broad set of skills in media and print production. This included creation of promotional materials and managing event registrations. Within six months, I was promoted and began transitioning to being lead designer in the Advancement Office."
                ]
            },
            {
                "subHeader": "Digital Printing Assistant at HUB Print and Postal Services  (May 2019-March 2020)",
                "text": [
                    "I interned full time at RIT’s print shop. Here, I participated in each stage of the production process. At the front, I served a customer service role, taking requests from clients and writing up jobs. In the printing rooms, I operated wide format, digital, and offset presses by myself, ensuring all jobs were completed in a timely manner."
                ]
            }
        ]
    },
    "skillsBlock": {
        "header": "Skills",
        "subBlocks": [
            {
                "subHeader": "Software",
                "text": [
                    "Adobe InDesign, Adobe Premiere Pro, Adobe Photoshop, Adobe Lightroom, Adobe After Effects, Adobe Illustrator, Adobe Animate, Adobe Media Encoder, Adobe Acrobat, Canva, Wix, Finalsite CMS, Sendible, Hootsuite, Microsoft Office, Google Suite, Figma. "
                ]
            },
            {
                "subHeader": "Creative Skills",
                "text": [
                    "Creative Branding, Magazine Publishing, Graphic Design, Creative Writing, Video Editing, Film Production, Photography, Photo Manipulation, DSLR Operation, Script Writing, Copywriting, Motion Graphics, Illustration, Drag & Drop Web Production, CMS Implementation, Web UI/UX Design, Audio Processing."
                ]
            },
            {
                "subHeader": "Other",
                "text": [
                    "Print Production, Production Workflow, Communication, Organization, Social Media Management, Advertising, Public Relations, Project Management, and a Positive Attitude :)"
                ]
            }
        ]
    }
}
